In [50]:
import pandas as pd
from pymongo import MongoClient
from collections import defaultdict
from urllib.parse import quote_plus
import requests

In [51]:

url = f"https://servicios.ine.es/wstempus/js/ES/DATOS_TABLA/6507?date=19750101:20231231"

In [52]:
resp = requests.get(url, params=None)
resp.raise_for_status()
data = resp.json()

In [53]:
df = pd.json_normalize(
    data,
    record_path="Data",
    meta=["COD", "Nombre", "FK_Unidad", "FK_Escala"],
    record_prefix="",       # opcional: no anteponer nada
    meta_prefix=""          # opcional
)

# 3) Convertir la fecha (ms desde 1970) a datetime legible
df["Fecha"] = pd.to_datetime(df["Fecha"], unit="ms")

df.head()

,Fecha,FK_TipoDato,FK_Periodo,Anyo,Valor,Secreto,COD,Nombre,FK_Unidad,FK_Escala
0,2022-12-31 23:00:00,1,28,2023,320656.0,False,MNP162,Total Nacional. Nacimiento. Total. Todas las e...,120,1
1,2021-12-31 23:00:00,1,28,2022,329251.0,False,MNP162,Total Nacional. Nacimiento. Total. Todas las e...,120,1
2,2020-12-31 23:00:00,1,28,2021,337380.0,False,MNP162,Total Nacional. Nacimiento. Total. Todas las e...,120,1
3,2019-12-31 23:00:00,1,28,2020,341315.0,False,MNP162,Total Nacional. Nacimiento. Total. Todas las e...,120,1
4,2018-12-31 23:00:00,1,28,2019,360617.0,False,MNP162,Total Nacional. Nacimiento. Total. Todas las e...,120,1

In [54]:
for columna in df.columns: 
    print(f"Nombre de la columna: {columna}")
    print(df[columna].unique())
    print("----")

Nombre de la columna: Fecha
<DatetimeArray>
['2022-12-31 23:00:00', '2021-12-31 23:00:00', '2020-12-31 23:00:00',
 '2019-12-31 23:00:00', '2018-12-31 23:00:00', '2017-12-31 23:00:00',
 '2016-12-31 23:00:00', '2015-12-31 23:00:00', '2014-12-31 23:00:00',
 '2013-12-31 23:00:00', '2012-12-31 23:00:00', '2011-12-31 23:00:00',
 '2010-12-31 23:00:00', '2009-12-31 23:00:00', '2008-12-31 23:00:00',
 '2007-12-31 23:00:00', '2006-12-31 23:00:00', '2005-12-31 23:00:00',
 '2004-12-31 23:00:00', '2003-12-31 23:00:00', '2002-12-31 23:00:00',
 '2001-12-31 23:00:00', '2000-12-31 23:00:00', '1999-12-31 23:00:00',
 '1998-12-31 23:00:00', '1997-12-31 23:00:00', '1996-12-31 23:00:00',
 '1995-12-31 23:00:00', '1994-12-31 23:00:00', '1993-12-31 23:00:00',
 '1992-12-31 23:00:00', '1991-12-31 23:00:00', '1990-12-31 23:00:00',
 '1989-12-31 23:00:00', '1988-12-31 23:00:00', '1987-12-31 23:00:00',
 '1986-12-31 23:00:00', '1985-12-31 23:00:00', '1984-12-31 23:00:00',
 '1983-12-31 23:00:00', '1982-12-31 23:00:00', '1981-12-31 23:00:00',
 '1980-12-31 23:00:00', '1979-12-31 23:00:00', '1978-12-31 23:00:00',
 '1977-12-31 23:00:00', '1976-12-31 23:00:00', '1975-12-31 23:00:00',
 '1974-12-31 23:00:00']
Length: 49, dtype: datetime64[ns]
----
Nombre de la columna: FK_TipoDato
[1]
----
Nombre de la columna: FK_Periodo
[28]
----
Nombre de la columna: Anyo
[2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010
 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996
 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982
 1981 1980 1979 1978 1977 1976 1975]
----
Nombre de la columna: Valor
[320656. 329251. 337380. ...    398.    376.    378.]
----
Nombre de la columna: Secreto
[False]
----
Nombre de la columna: COD
['MNP162' 'MNP161' 'MNP160' 'MNP219' 'MNP218' 'MNP217' 'MNP216' 'MNP215'
 'MNP214' 'MNP213' 'MNP212' 'MNP211' 'MNP210' 'MNP209' 'MNP208' 'MNP207'
 'MNP206' 'MNP205' 'MNP204' 'MNP203' 'MNP202' 'MNP201' 'MNP200' 'MNP199'
 'MNP198' 'MNP197' 'MNP196' 'MNP195' 'MNP194' 'MNP193' 'MNP192' 'MNP191'
 'MNP190' 'MNP189' 'MNP188' 'MNP187' 'MNP186' 'MNP185' 'MNP184' 'MNP183'
 'MNP182' 'MNP181' 'MNP180' 'MNP179' 'MNP178' 'MNP177' 'MNP176' 'MNP175'
 'MNP174' 'MNP173' 'MNP172' 'MNP171' 'MNP170' 'MNP169' 'MNP168' 'MNP167'
 'MNP166' 'MNP165' 'MNP164' 'MNP163' 'MNP159' 'MNP158' 'MNP157']
----
Nombre de la columna: Nombre
['Total Nacional. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Total Nacional. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Total Nacional. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Andalucía. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Andalucía. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Andalucía. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Aragón. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Aragón. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Aragón. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Asturias, Principado de. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Asturias, Principado de. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Asturias, Principado de. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Balears, Illes. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Balears, Illes. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Balears, Illes. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Canarias. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Canarias. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Canarias. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cantabria. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cantabria. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cantabria. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla y León. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla y León. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla y León. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla - La Mancha. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla - La Mancha. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Castilla - La Mancha. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cataluña. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cataluña. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Cataluña. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Comunitat Valenciana. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Comunitat Valenciana. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Comunitat Valenciana. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extremadura. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extremadura. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extremadura. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Galicia. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Galicia. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Galicia. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Madrid, Comunidad de. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Madrid, Comunidad de. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Madrid, Comunidad de. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Murcia, Región de. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Murcia, Región de. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Murcia, Región de. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Navarra, Comunidad Foral de. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Navarra, Comunidad Foral de. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Navarra, Comunidad Foral de. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'País Vasco. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'País Vasco. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'País Vasco. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Rioja, La. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Rioja, La. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Rioja, La. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Ceuta. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Ceuta. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Ceuta. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Melilla. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Melilla. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Melilla. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extranjero. Nacimiento. Total. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extranjero. Nacimiento. Hombres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. '
 'Extranjero. Nacimiento. Mujeres. Todas las edades. Total. Lugar de residencia de la madre. Dato base. ']
----
Nombre de la columna: FK_Unidad
[120]
----
Nombre de la columna: FK_Escala
[1]
----

In [55]:
# 1) Extraer Comunidad (todo hasta el primer punto) y Sexo (lo que sigue a "Nacimiento. " hasta el siguiente punto)
df['Comunidad'] = df['Nombre'].str.extract(r'^(.*?)\.')
df['Sexo']       = df['Nombre'].str.extract(r'Nacimiento\. ([^\.]+)\.')

# 2) Seleccionar y renombrar columnas
df2 = df.loc[:, ['Comunidad', 'Sexo', 'Anyo', 'Valor']].copy()
df2.rename(columns={
    'Comunidad': 'Comunidades y Ciudades Autónomas',
    'Anyo':       'Periodo',
    'Valor':      'Total'
}, inplace=True)

# 3) Ordenar por Comunidad y luego por Sexo en el orden Total→Hombres→Mujeres
ordering = {'Total': 0, 'Hombres': 1, 'Mujeres': 2}
df2['sexo_ord'] = df2['Sexo'].map(ordering)
df2.sort_values(['Comunidades y Ciudades Autónomas', 'sexo_ord'], inplace=True)
df2.drop(columns='sexo_ord', inplace=True)

In [56]:
df2.head()

    Comunidades y Ciudades Autónomas   Sexo  Periodo    Total
147                        Andalucía  Total     2023  61397.0
148                        Andalucía  Total     2022  62967.0
149                        Andalucía  Total     2021  65650.0
150                        Andalucía  Total     2020  65522.0
151                        Andalucía  Total     2019  69397.0

In [57]:
for columna in df2.columns: 
    print(f"Nombre de la columna: {columna}")
    l = df2[columna].unique()
    print(l)
    print(len(l))
    print("----")

Nombre de la columna: Comunidades y Ciudades Autónomas
['Andalucía' 'Aragón' 'Asturias, Principado de' 'Balears, Illes'
 'Canarias' 'Cantabria' 'Castilla - La Mancha' 'Castilla y León'
 'Cataluña' 'Ceuta' 'Comunitat Valenciana' 'Extranjero' 'Extremadura'
 'Galicia' 'Madrid, Comunidad de' 'Melilla' 'Murcia, Región de'
 'Navarra, Comunidad Foral de' 'País Vasco' 'Rioja, La' 'Total Nacional']
21
----
Nombre de la columna: Sexo
['Total' 'Hombres' 'Mujeres']
3
----
Nombre de la columna: Periodo
[2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 2011 2010
 2009 2008 2007 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996
 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982
 1981 1980 1979 1978 1977 1976 1975]
49
----
Nombre de la columna: Total
[ 61397.  62967.  65650. ... 317256. 328224. 322992.]
2880
----

In [58]:
# 1) Extraer Comunidad y Sexo
df['Comunidad'] = (
    df['Nombre']
      .str.extract(r'^(.*?)\.')   # todo hasta el primer punto
      .iloc[:,0]
      .str.strip()
      .replace({'Total Nacional': 'Total'})  # renombrar para tu Excel
)

df['Sexo'] = (
    df['Nombre']
      .str.extract(r'Nacimiento\. ([^\.]+)\.')
      .iloc[:,0]
      .str.strip()
)

# 2) Montar df2 y renombrar columnas
df2 = (
    df.loc[:, ['Comunidad', 'Sexo', 'Anyo', 'Valor']]
      .rename(columns={
          'Comunidad': 'Comunidades y Ciudades Autónomas',
          'Anyo':       'Periodo',
          'Valor':      'Total'
      })
)

# 3) Definir orden para Sexo y Comunidades
sexo_order = ['Total', 'Hombres', 'Mujeres']
df2['Sexo'] = pd.Categorical(df2['Sexo'], categories=sexo_order, ordered=True)

# Para Comunidades: queremos “Total” primero y luego alfabético
comunidades = list(df2['Comunidades y Ciudades Autónomas'].unique())
# nos aseguramos de que “Total” está solo una vez y al principio
comunidades = ['Total'] + sorted([c for c in comunidades if c != 'Total'])
df2['Comunidades y Ciudades Autónomas'] = pd.Categorical(
    df2['Comunidades y Ciudades Autónomas'],
    categories=comunidades,
    ordered=True
)

# 4) Ordenar el DataFrame
df2 = df2.sort_values(
    ['Comunidades y Ciudades Autónomas', 'Sexo', 'Periodo'],
    ignore_index=True
)

In [59]:
df2.head()

  Comunidades y Ciudades Autónomas   Sexo  Periodo     Total
0                            Total  Total     1975  669378.0
1                            Total  Total     1976  677456.0
2                            Total  Total     1977  656357.0
3                            Total  Total     1978  636892.0
4                            Total  Total     1979  601992.0

In [60]:
for columna in df2.columns: 
    print(f"Nombre de la columna: {columna}")
    l = df2[columna].unique()
    print(len(l))
    print("----")

Nombre de la columna: Comunidades y Ciudades Autónomas
21
----
Nombre de la columna: Sexo
3
----
Nombre de la columna: Periodo
49
----
Nombre de la columna: Total
2880
----

In [61]:
df2.head(49)

   Comunidades y Ciudades Autónomas   Sexo  Periodo     Total
0                             Total  Total     1975  669378.0
1                             Total  Total     1976  677456.0
2                             Total  Total     1977  656357.0
3                             Total  Total     1978  636892.0
4                             Total  Total     1979  601992.0
5                             Total  Total     1980  571018.0
6                             Total  Total     1981  533008.0
7                             Total  Total     1982  515706.0
8                             Total  Total     1983  485352.0
9                             Total  Total     1984  473281.0
10                            Total  Total     1985  456298.0
11                            Total  Total     1986  438750.0
12                            Total  Total     1987  426782.0
13                            Total  Total     1988  418919.0
14                            Total  Total     1989  408434.0
15                            Total  Total     1990  401425.0
16                            Total  Total     1991  395989.0
17                            Total  Total     1992  396747.0
18                            Total  Total     1993  385786.0
19                            Total  Total     1994  370148.0
20                            Total  Total     1995  363469.0
21                            Total  Total     1996  362626.0
22                            Total  Total     1997  369035.0
23                            Total  Total     1998  365193.0
24                            Total  Total     1999  380130.0
25                            Total  Total     2000  397632.0
26                            Total  Total     2001  406380.0
27                            Total  Total     2002  418846.0
28                            Total  Total     2003  441881.0
29                            Total  Total     2004  454591.0
30                            Total  Total     2005  466371.0
31                            Total  Total     2006  482957.0
32                            Total  Total     2007  492527.0
33                            Total  Total     2008  519779.0
34                            Total  Total     2009  494997.0
35                            Total  Total     2010  486575.0
36                            Total  Total     2011  471999.0
37                            Total  Total     2012  454648.0
38                            Total  Total     2013  425715.0
39                            Total  Total     2014  427595.0
40                            Total  Total     2015  420290.0
41                            Total  Total     2016  410583.0
42                            Total  Total     2017  393181.0
43                            Total  Total     2018  372777.0
44                            Total  Total     2019  360617.0
45                            Total  Total     2020  341315.0
46                            Total  Total     2021  337380.0
47                            Total  Total     2022  329251.0
48                            Total  Total     2023  320656.0

In [62]:
df_final= df2.copy()

In [63]:
df_final["sex"] = df_final["Sexo"].map({"Hombres": "M", "Mujeres": "F", "Total": "T"})

In [64]:
df_final.rename(columns={"Total": "births", "Periodo": "year"}, inplace=True)

In [65]:
df_final.sample()

     Comunidades y Ciudades Autónomas   Sexo  year   births sex
2085                          Galicia  Total  2002  19327.0   T

In [66]:
print(list(df_final['Comunidades y Ciudades Autónomas'].unique()))

['Total', 'Andalucía', 'Aragón', 'Asturias, Principado de', 'Balears, Illes', 'Canarias', 'Cantabria', 'Castilla - La Mancha', 'Castilla y León', 'Cataluña', 'Ceuta', 'Comunitat Valenciana', 'Extranjero', 'Extremadura', 'Galicia', 'Madrid, Comunidad de', 'Melilla', 'Murcia, Región de', 'Navarra, Comunidad Foral de', 'País Vasco', 'Rioja, La']

In [67]:
df_codigos_ccaa_ine = pd.read_csv('../data/codigos_ine_prov_ccaa/codigos_ccaa.csv', sep=';', dtype={
        'cod': 'string', 
        'nombre_ine': 'string',
    })
df_codigos_ccaa_mongo = pd.read_csv('../data/codigos_ine_prov_ccaa/codigos_ccaa_sin_CeutaMelilla.csv', sep=';', dtype={
        'cod_ccaa': 'string', 
        'name': 'string',
    })

In [68]:
# Mapear nombre -> código INE
# Creamos un dict de mapeo a partir de df_codigos_ccaa_ine
map_name_to_code = dict(
    zip(df_codigos_ccaa_ine['nombre_ine'], df_codigos_ccaa_ine['cod'])
)

In [69]:
map_name_to_code['Total'] = "Total"
map_name_to_code['Extranjero'] = "Extranjero"

In [70]:
# Aplicamos el mapeo para crear la columna code_ine_ccaa en df_final
df_final['code_ine_ccaa'] = df_final['Comunidades y Ciudades Autónomas'].map(map_name_to_code)

# Comprueba que no haya NaN inesperados
missing = df_final[df_final['code_ine_ccaa'].isna()]['Comunidades y Ciudades Autónomas'].unique()
if len(missing):
    print("No se han encontrado códigos para estos nombres:", missing)

In [71]:
list(df_final['code_ine_ccaa'].unique())

['Total',
 '01',
 '02',
 '03',
 '04',
 '05',
 '06',
 '08',
 '07',
 '09',
 '18',
 '10',
 'Extranjero',
 '11',
 '12',
 '13',
 '19',
 '14',
 '15',
 '16',
 '17']

In [72]:
# Mapear código INE → nombre para Metabase
# Creamos un dict de mapeo a partir de df_codigos_ccaa_mongo
map_code_to_mongo_name = dict(
    zip(df_codigos_ccaa_mongo['cod_ccaa'], df_codigos_ccaa_mongo['name'])
)

In [73]:
map_code_to_mongo_name["Total"] = "Total"
map_code_to_mongo_name["18"] = "Ceuta"
map_code_to_mongo_name["19"] = "Melilla"
map_code_to_mongo_name["Extranjero"] = "Extranjero"

In [74]:
# Aplicamos el mapeo para crear la columna name_ccaa
df_final['name_ccaa'] = df_final['code_ine_ccaa'] \
    .map(map_code_to_mongo_name)

# Verifica ausencias
missing2 = df_final[df_final['name_ccaa'].isna()]['code_ine_ccaa'].unique()
if len(missing2):
    print("Estos códigos INE no tienen nombre en tu tabla Mongo:", missing2)

In [75]:
# 3) Seleccionar solo las columnas definitivas
df_clean = df_final[[
    'year',
    'sex',
    'births',
    'code_ine_ccaa',
    'name_ccaa'
]].copy()

# Comprobación final
print("Estructura final:")
print(df_clean.dtypes)
print(df_clean.head())

Estructura final:
year                int64
sex              category
births            float64
code_ine_ccaa    category
name_ccaa        category
dtype: object
   year sex    births code_ine_ccaa name_ccaa
0  1975   T  669378.0         Total     Total
1  1976   T  677456.0         Total     Total
2  1977   T  656357.0         Total     Total
3  1978   T  636892.0         Total     Total
4  1979   T  601992.0         Total     Total

In [76]:
# Configurar conexión
usuario = "jalope"
contrasena = "admin"
host = "127.0.0.1"
puerto = "27250"

uri = f"mongodb://{quote_plus(usuario)}:{quote_plus(contrasena)}@{host}:{puerto}/?directConnection=true"
client = MongoClient(uri)
db = client["tfm_db"]

In [77]:
coll = db['INE_6507_POBLACION_NACIMIENTOS_RAW']
coll.drop()
coll.insert_many(df_clean.to_dict('records'))
print("Registros en la colección: ", coll.count_documents({}))
print("Número de filas de df_raw: ", len(df_clean))

Registros en la colección:  3087
Número de filas de df_raw:  3087